{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "video_input"}, "registered_name": null, "name": "video_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Resizing", "config": {"name": "resizing", "trainable": true, "dtype": "float32", "height": 224, "width": 224, "interpolation": "bilinear", "crop_to_aspect_ratio": false}, "registered_name": null, "build_config": {"input_shape": [null, 256, 256, 3]}}}, "registered_name": null, "build_config": {"input_shape": [null, 20, 256, 256, 3]}, "name": "time_distributed", "inbound_nodes": [[["video_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "dtype": "float32", "layer": {"module": "tensorflow_hub.keras_layer", "class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/google/imagenet/mobilenet_v2_130_224/classification/5"}, "registered_name": "KerasLayer", "build_config": {"input_shape": [null, 224, 224, 3]}}}, "registered_name": null, "build_config": {"input_shape": [null, 20, 224, 224, 3]}, "name": "time_distributed_1", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "dtype": "float32", "layer": {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1001]}}}, "registered_name": null, "build_config": {"input_shape": [null, 20, 1001]}, "name": "time_distributed_2", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "action_input"}, "registered_name": null, "name": "action_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null, "build_config": {"input_shape": [null, 20, 1001]}, "name": "lstm", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "registered_name": null, "build_config": {"input_shape": [null, 19, 4]}, "name": "lstm_1", "inbound_nodes": [[["action_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 128], [null, 64]]}, "name": "concatenate", "inbound_nodes": [[["lstm", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 192]}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}], "input_layers": [["video_input", 0, 0], ["action_input", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}